module.exports = {
    member:{
        test:{
            "pid": "16112109533877254",
            "Key": "39ccfc8f32c6a5e026ca7bfe2f1bf9a8",
            "core_merchant_no": "EW_N8636137588",
        }
    },
    industry:[
        [
            {
                "id": 2,
                "name": "企业"
            },
            {
                "id": 1,
                "name": "个体工商户"
            },
            {
                "id": 3,
                "name": "事业单位"
            }
        ],
        [
            {
                "id": "1",
                "pid": "1",
                "name": "保险"
            },
            {
                "id": "1",
                "pid": "10",
                "name": "金融"
            },
            {
                "id": "1",
                "pid": "11",
                "name": "快递/货运服务"
            },
            {
                "id": "1",
                "pid": "12",
                "name": "苗木/绿化"
            },
            {
                "id": "1",
                "pid": "13",
                "name": "母婴/玩具"
            },
            {
                "id": "1",
                "pid": "14",
                "name": "票务"
            },
            {
                "id": "1",
                "pid": "15",
                "name": "其他"
            },
            {
                "id": "1",
                "pid": "16",
                "name": "其他生活缴费"
            },
            {
                "id": "1",
                "pid": "17",
                "name": "软件"
            },
            {
                "id": "1",
                "pid": "18",
                "name": "生活/家居"
            },
            {
                "id": "1",
                "pid": "19",
                "name": "生活/咨询服务"
            },
            {
                "id": "1",
                "pid": "2",
                "name": "彩票"
            },
            {
                "id": "1",
                "pid": "20",
                "name": "时尚"
            },
            {
                "id": "1",
                "pid": "21",
                "name": "收藏/宠物"
            },
            {
                "id": "1",
                "pid": "22",
                "name": "书籍/音像/文具"
            },
            {
                "id": "1",
                "pid": "23",
                "name": "数码"
            },
            {
                "id": "1",
                "pid": "24",
                "name": "数字娱乐"
            },
            {
                "id": "1",
                "pid": "25",
                "name": "通信"
            },
            {
                "id": "1",
                "pid": "26",
                "name": "网络虚拟服务"
            },
            {
                "id": "1",
                "pid": "27",
                "name": "线下零售"
            },
            {
                "id": "1",
                "pid": "28",
                "name": "医疗"
            },
            {
                "id": "1",
                "pid": "29",
                "name": "娱乐/健身服务"
            },
            {
                "id": "1",
                "pid": "3",
                "name": "餐饮/食品"
            },
            {
                "id": "1",
                "pid": "30",
                "name": "装饰"
            },
            {
                "id": "1",
                "pid": "4",
                "name": "房地产"
            },
            {
                "id": "1",
                "pid": "5",
                "name": "公共事业缴费"
            },
            {
                "id": "1",
                "pid": "6",
                "name": "机票/旅游"
            },
            {
                "id": "1",
                "pid": "7",
                "name": "机械/电子"
            },
            {
                "id": "1",
                "pid": "8",
                "name": "交通运输服务类"
            },
            {
                "id": "1",
                "pid": "9",
                "name": "教育/培训"
            },
            {
                "id": "2",
                "pid": "31",
                "name": "保险"
            },
            {
                "id": "2",
                "pid": "32",
                "name": "彩票"
            },
            {
                "id": "2",
                "pid": "33",
                "name": "餐饮/食品"
            },
            {
                "id": "2",
                "pid": "34",
                "name": "电商/团购"
            },
            {
                "id": "2",
                "pid": "35",
                "name": "房地产"
            },
            {
                "id": "2",
                "pid": "36",
                "name": "公共事业缴费"
            },
            {
                "id": "2",
                "pid": "37",
                "name": "公益"
            },
            {
                "id": "2",
                "pid": "38",
                "name": "机票/旅游"
            },
            {
                "id": "2",
                "pid": "39",
                "name": "机械/电子"
            },
            {
                "id": "2",
                "pid": "40",
                "name": "交通运输服务类"
            },
            {
                "id": "2",
                "pid": "41",
                "name": "教育/培训"
            },
            {
                "id": "2",
                "pid": "42",
                "name": "金融"
            },
            {
                "id": "2",
                "pid": "43",
                "name": "境外"
            },
            {
                "id": "2",
                "pid": "44",
                "name": "快递/货运服务"
            },
            {
                "id": "2",
                "pid": "45",
                "name": "苗木/绿化"
            },
            {
                "id": "2",
                "pid": "46",
                "name": "母婴/玩具"
            },
            {
                "id": "2",
                "pid": "47",
                "name": "票务"
            },
            {
                "id": "2",
                "pid": "48",
                "name": "平台商"
            },
            {
                "id": "2",
                "pid": "49",
                "name": "其他"
            },
            {
                "id": "2",
                "pid": "50",
                "name": "其他生活缴费"
            },
            {
                "id": "2",
                "pid": "51",
                "name": "软件"
            },
            {
                "id": "2",
                "pid": "52",
                "name": "生活/家居"
            },
            {
                "id": "2",
                "pid": "53",
                "name": "生活/咨询服务"
            },
            {
                "id": "2",
                "pid": "54",
                "name": "时尚"
            },
            {
                "id": "2",
                "pid": "55",
                "name": "收藏/宠物"
            },
            {
                "id": "2",
                "pid": "56",
                "name": "书籍/音像/文具"
            },
            {
                "id": "2",
                "pid": "57",
                "name": "数码"
            },
            {
                "id": "2",
                "pid": "58",
                "name": "数字娱乐"
            },
            {
                "id": "2",
                "pid": "59",
                "name": "通信"
            },
            {
                "id": "2",
                "pid": "60",
                "name": "网络虚拟服务"
            },
            {
                "id": "2",
                "pid": "61",
                "name": "线下零售"
            },
            {
                "id": "2",
                "pid": "62",
                "name": "医疗"
            },
            {
                "id": "2",
                "pid": "63",
                "name": "娱乐/健身服务"
            },
            {
                "id": "2",
                "pid": "64",
                "name": "预付卡"
            },
            {
                "id": "2",
                "pid": "65",
                "name": "直销"
            },
            {
                "id": "2",
                "pid": "66",
                "name": "众筹"
            },
            {
                "id": "2",
                "pid": "67",
                "name": "装饰"
            },
            {
                "id": "3",
                "pid": "68",
                "name": "公共事业缴费"
            },
            {
                "id": "3",
                "pid": "69",
                "name": "机票/旅游"
            },
            {
                "id": "3",
                "pid": "70",
                "name": "交通运输服务类"
            },
            {
                "id": "3",
                "pid": "71",
                "name": "教育/培训"
            },
            {
                "id": "3",
                "pid": "72",
                "name": "快递/货运服务"
            },
            {
                "id": "3",
                "pid": "73",
                "name": "票务"
            },
            {
                "id": "3",
                "pid": "74",
                "name": "其他生活缴费"
            },
            {
                "id": "3",
                "pid": "75",
                "name": "生活/咨询服务"
            },
            {
                "id": "3",
                "pid": "76",
                "name": "医疗"
            }
        ],
        [
            {
                "wft": "246",
                "id": "1",
                "pid": "1",
                "name": "保险代理公司"
            },
            {
                "wft": "248",
                "id": "1",
                "pid": "1",
                "name": "保险公估公司"
            },
            {
                "wft": "249",
                "id": "1",
                "pid": "1",
                "name": "保险兼业代理公司"
            },
            {
                "wft": "247",
                "id": "1",
                "pid": "1",
                "name": "保险经纪公司"
            },
            {
                "wft": "211",
                "id": "1",
                "pid": "2",
                "name": "彩票"
            },
            {
                "wft": "145",
                "id": "1",
                "pid": "3",
                "name": "保健品/滋补品"
            },
            {
                "wft": "212",
                "id": "1",
                "pid": "3",
                "name": "餐饮"
            },
            {
                "wft": "144",
                "id": "1",
                "pid": "3",
                "name": "普通食品"
            },
            {
                "wft": "488",
                "id": "1",
                "pid": "4",
                "name": "房屋中介"
            },
            {
                "wft": "394",
                "id": "1",
                "pid": "5",
                "name": "水电煤缴费/交通罚款等生活缴费"
            },
            {
                "wft": "178",
                "id": "1",
                "pid": "6",
                "name": "机票代理"
            },
            {
                "wft": "179",
                "id": "1",
                "pid": "6",
                "name": "旅馆/酒店/景区/度假区"
            },
            {
                "wft": "176",
                "id": "1",
                "pid": "6",
                "name": "旅行社"
            },
            {
                "wft": "304",
                "id": "1",
                "pid": "7",
                "name": "保健器械"
            },
            {
                "wft": "306",
                "id": "1",
                "pid": "7",
                "name": "电子元器件/仪器仪表/机械设备及配件"
            },
            {
                "wft": "305",
                "id": "1",
                "pid": "7",
                "name": "医疗器械"
            },
            {
                "wft": "495",
                "id": "1",
                "pid": "8",
                "name": "道路运输"
            },
            {
                "wft": "498",
                "id": "1",
                "pid": "8",
                "name": "港口经营港口理货"
            },
            {
                "wft": "497",
                "id": "1",
                "pid": "8",
                "name": "海运"
            },
            {
                "wft": "499",
                "id": "1",
                "pid": "8",
                "name": "航空运输"
            },
            {
                "wft": "496",
                "id": "1",
                "pid": "8",
                "name": "水路运输"
            },
            {
                "wft": "494",
                "id": "1",
                "pid": "8",
                "name": "铁路货物运输"
            },
            {
                "wft": "489",
                "id": "1",
                "pid": "8",
                "name": "租车"
            },
            {
                "wft": "159",
                "id": "1",
                "pid": "9",
                "name": "教育/培训/考试缴费/学费"
            },
            {
                "wft": "333",
                "id": "1",
                "pid": "9",
                "name": "私立院校"
            },
            {
                "wft": "433",
                "id": "1",
                "pid": "10",
                "name": "财经资讯"
            },
            {
                "wft": "434",
                "id": "1",
                "pid": "10",
                "name": "股票软件类"
            },
            {
                "wft": "413",
                "id": "1",
                "pid": "11",
                "name": "物流/快递公司"
            },
            {
                "wft": "314",
                "id": "1",
                "pid": "12",
                "name": "苗木种植"
            },
            {
                "wft": "315",
                "id": "1",
                "pid": "12",
                "name": "园林绿化"
            },
            {
                "wft": "158",
                "id": "1",
                "pid": "13",
                "name": "母婴类商城"
            },
            {
                "wft": "157",
                "id": "1",
                "pid": "13",
                "name": "母婴用品/儿童玩具"
            },
            {
                "wft": "164",
                "id": "1",
                "pid": "14",
                "name": "火车票/船票/车票等交通票务"
            },
            {
                "wft": "163",
                "id": "1",
                "pid": "14",
                "name": "影票/演唱会/赛事等娱乐票务"
            },
            {
                "wft": "292",
                "id": "1",
                "pid": "15",
                "name": "其他行业"
            },
            {
                "wft": "316",
                "id": "1",
                "pid": "16",
                "name": "城市交通卡缴费"
            },
            {
                "wft": "317",
                "id": "1",
                "pid": "16",
                "name": "其他生活缴费"
            },
            {
                "wft": "308",
                "id": "1",
                "pid": "16",
                "name": "停车场"
            },
            {
                "wft": "309",
                "id": "1",
                "pid": "16",
                "name": "物业管理费"
            },
            {
                "wft": "307",
                "id": "1",
                "pid": "16",
                "name": "有线电视缴费"
            },
            {
                "wft": "273",
                "id": "1",
                "pid": "17",
                "name": "软件"
            },
            {
                "wft": "149",
                "id": "1",
                "pid": "18",
                "name": "工艺品/盆栽/室内装饰品"
            },
            {
                "wft": "147",
                "id": "1",
                "pid": "18",
                "name": "计生用品"
            },
            {
                "wft": "143",
                "id": "1",
                "pid": "18",
                "name": "家居/建材/装饰/布艺类商城"
            },
            {
                "wft": "146",
                "id": "1",
                "pid": "18",
                "name": "家用电器"
            },
            {
                "wft": "148",
                "id": "1",
                "pid": "18",
                "name": "美妆/护肤/个人护理"
            },
            {
                "wft": "153",
                "id": "1",
                "pid": "18",
                "name": "汽车/摩托/自行车/其他交通工具/配件/改装"
            },
            {
                "wft": "476",
                "id": "1",
                "pid": "19",
                "name": "办证/刻章"
            },
            {
                "wft": "474",
                "id": "1",
                "pid": "19",
                "name": "广告公司"
            },
            {
                "wft": "475",
                "id": "1",
                "pid": "19",
                "name": "会展服务/活动策划"
            },
            {
                "wft": "471",
                "id": "1",
                "pid": "19",
                "name": "家政/婚庆服务/摄影服务"
            },
            {
                "wft": "477",
                "id": "1",
                "pid": "19",
                "name": "开锁工具"
            },
            {
                "wft": "224",
                "id": "1",
                "pid": "19",
                "name": "人才中介机构/招聘/猎头"
            },
            {
                "wft": "473",
                "id": "1",
                "pid": "19",
                "name": "丧葬行业"
            },
            {
                "wft": "472",
                "id": "1",
                "pid": "19",
                "name": "印刷/维修服务/排版/刻板"
            },
            {
                "wft": "225",
                "id": "1",
                "pid": "19",
                "name": "职业社交/婚介/交友"
            },
            {
                "wft": "470",
                "id": "1",
                "pid": "19",
                "name": "咨询/法律咨询/金融咨询等"
            },
            {
                "wft": "111",
                "id": "1",
                "pid": "20",
                "name": "服饰类商城/服饰配件/箱包"
            },
            {
                "wft": "113",
                "id": "1",
                "pid": "20",
                "name": "户外/运动/健身器材/安防"
            },
            {
                "wft": "116",
                "id": "1",
                "pid": "20",
                "name": "黄金珠宝/钻石/玉石"
            },
            {
                "wft": "114",
                "id": "1",
                "pid": "20",
                "name": "乐器"
            },
            {
                "wft": "112",
                "id": "1",
                "pid": "20",
                "name": "礼品/鲜花/纪念品"
            },
            {
                "wft": "117",
                "id": "1",
                "pid": "20",
                "name": "饰品"
            },
            {
                "wft": "115",
                "id": "1",
                "pid": "20",
                "name": "手表/钟表/眼镜"
            },
            {
                "wft": "196",
                "id": "1",
                "pid": "21",
                "name": "宠物/宠物食品"
            },
            {
                "wft": "197",
                "id": "1",
                "pid": "21",
                "name": "非文物类收藏品"
            },
            {
                "wft": "186",
                "id": "1",
                "pid": "21",
                "name": "文物复制品销售/典当"
            },
            {
                "wft": "198",
                "id": "1",
                "pid": "21",
                "name": "文物经营"
            },
            {
                "wft": "199",
                "id": "1",
                "pid": "21",
                "name": "文物拍卖"
            },
            {
                "wft": "184",
                "id": "1",
                "pid": "22",
                "name": "书籍/音像"
            },
            {
                "wft": "185",
                "id": "1",
                "pid": "22",
                "name": "文具"
            },
            {
                "wft": "214",
                "id": "1",
                "pid": "23",
                "name": "办公设备"
            },
            {
                "wft": "213",
                "id": "1",
                "pid": "23",
                "name": "数码产品"
            },
            {
                "wft": "282",
                "id": "1",
                "pid": "24",
                "name": "彩铃"
            },
            {
                "wft": "425",
                "id": "1",
                "pid": "25",
                "name": "话费通讯"
            },
            {
                "wft": "424",
                "id": "1",
                "pid": "25",
                "name": "宽带收费"
            },
            {
                "wft": "266",
                "id": "1",
                "pid": "26",
                "name": "门户/资讯/论坛"
            },
            {
                "wft": "267",
                "id": "1",
                "pid": "26",
                "name": "视频/网络小说/在线图书/音乐"
            },
            {
                "wft": "269",
                "id": "1",
                "pid": "26",
                "name": "搜索引擎/网络广告/网络推广/视频制作"
            },
            {
                "wft": "272",
                "id": "1",
                "pid": "26",
                "name": "游戏/点卡/金币"
            },
            {
                "wft": "268",
                "id": "1",
                "pid": "26",
                "name": "域名/建站/主机/代码"
            },
            {
                "wft": "487",
                "id": "1",
                "pid": "27",
                "name": "便利店"
            },
            {
                "wft": "486",
                "id": "1",
                "pid": "27",
                "name": "其他综合零售"
            },
            {
                "wft": "329",
                "id": "1",
                "pid": "28",
                "name": "保健信息咨询/心理咨询/体检卡"
            },
            {
                "wft": "395",
                "id": "1",
                "pid": "28",
                "name": "亲子鉴定/催眠"
            },
            {
                "wft": "378",
                "id": "1",
                "pid": "28",
                "name": "私立/民营医院/诊所"
            },
            {
                "wft": "328",
                "id": "1",
                "pid": "28",
                "name": "药品"
            },
            {
                "wft": "345",
                "id": "1",
                "pid": "29",
                "name": "俱乐部/高尔夫球场/休闲会所"
            },
            {
                "wft": "344",
                "id": "1",
                "pid": "29",
                "name": "美容/健身类会所"
            },
            {
                "wft": "346",
                "id": "1",
                "pid": "29",
                "name": "游艺厅/KTV/网吧"
            },
            {
                "wft": "322",
                "id": "1",
                "pid": "30",
                "name": "室内装饰设计服务"
            },
            {
                "wft": "242",
                "id": "2",
                "pid": "31",
                "name": "保险代理公司"
            },
            {
                "wft": "244",
                "id": "2",
                "pid": "31",
                "name": "保险公估公司"
            },
            {
                "wft": "241",
                "id": "2",
                "pid": "31",
                "name": "保险公司"
            },
            {
                "wft": "245",
                "id": "2",
                "pid": "31",
                "name": "保险兼业代理公司"
            },
            {
                "wft": "243",
                "id": "2",
                "pid": "31",
                "name": "保险经纪公司"
            },
            {
                "wft": "210",
                "id": "2",
                "pid": "32",
                "name": "彩票"
            },
            {
                "wft": "133",
                "id": "2",
                "pid": "33",
                "name": "保健品/滋补品"
            },
            {
                "wft": "139",
                "id": "2",
                "pid": "33",
                "name": "餐饮"
            },
            {
                "wft": "132",
                "id": "2",
                "pid": "33",
                "name": "普通食品"
            },
            {
                "wft": "392",
                "id": "2",
                "pid": "34",
                "name": "海淘"
            },
            {
                "wft": "391",
                "id": "2",
                "pid": "34",
                "name": "团购"
            },
            {
                "wft": "393",
                "id": "2",
                "pid": "34",
                "name": "线上商超"
            },
            {
                "wft": "326",
                "id": "2",
                "pid": "35",
                "name": "房产预售"
            },
            {
                "wft": "327",
                "id": "2",
                "pid": "35",
                "name": "房屋中介"
            },
            {
                "wft": "351",
                "id": "2",
                "pid": "36",
                "name": "水电煤缴费/交通罚款等生活缴费"
            },
            {
                "wft": "250",
                "id": "2",
                "pid": "37",
                "name": "公益"
            },
            {
                "wft": "173",
                "id": "2",
                "pid": "38",
                "name": "航空公司"
            },
            {
                "wft": "174",
                "id": "2",
                "pid": "38",
                "name": "机票代理"
            },
            {
                "wft": "175",
                "id": "2",
                "pid": "38",
                "name": "旅馆/酒店/景区/度假区"
            },
            {
                "wft": "171",
                "id": "2",
                "pid": "38",
                "name": "旅行社"
            },
            {
                "wft": "172",
                "id": "2",
                "pid": "38",
                "name": "旅游服务平台"
            },
            {
                "wft": "301",
                "id": "2",
                "pid": "39",
                "name": "保健器械"
            },
            {
                "wft": "303",
                "id": "2",
                "pid": "39",
                "name": "电子元器件/仪器仪表/机械设备及配件"
            },
            {
                "wft": "302",
                "id": "2",
                "pid": "39",
                "name": "医疗器械"
            },
            {
                "wft": "372",
                "id": "2",
                "pid": "40",
                "name": "道路运输"
            },
            {
                "wft": "375",
                "id": "2",
                "pid": "40",
                "name": "港口经营港口理货"
            },
            {
                "wft": "374",
                "id": "2",
                "pid": "40",
                "name": "海运"
            },
            {
                "wft": "376",
                "id": "2",
                "pid": "40",
                "name": "航空运输"
            },
            {
                "wft": "373",
                "id": "2",
                "pid": "40",
                "name": "水路运输"
            },
            {
                "wft": "371",
                "id": "2",
                "pid": "40",
                "name": "铁路货物运输"
            },
            {
                "wft": "377",
                "id": "2",
                "pid": "40",
                "name": "租车"
            },
            {
                "wft": "154",
                "id": "2",
                "pid": "41",
                "name": "教育/培训/考试缴费/学费"
            },
            {
                "wft": "332",
                "id": "2",
                "pid": "41",
                "name": "私立院校"
            },
            {
                "wft": "431",
                "id": "2",
                "pid": "42",
                "name": "财经资讯"
            },
            {
                "wft": "432",
                "id": "2",
                "pid": "42",
                "name": "股票软件类"
            },
            {
                "wft": "435",
                "id": "2",
                "pid": "43",
                "name": "境外"
            },
            {
                "wft": "411",
                "id": "2",
                "pid": "44",
                "name": "物流/快递公司"
            },
            {
                "wft": "313",
                "id": "2",
                "pid": "45",
                "name": "化肥/农用药剂等"
            },
            {
                "wft": "311",
                "id": "2",
                "pid": "45",
                "name": "苗木种植"
            },
            {
                "wft": "312",
                "id": "2",
                "pid": "45",
                "name": "园林绿化"
            },
            {
                "wft": "152",
                "id": "2",
                "pid": "46",
                "name": "母婴类商城"
            },
            {
                "wft": "151",
                "id": "2",
                "pid": "46",
                "name": "母婴用品/儿童玩具"
            },
            {
                "wft": "162",
                "id": "2",
                "pid": "47",
                "name": "火车票/船票/车票等交通票务"
            },
            {
                "wft": "161",
                "id": "2",
                "pid": "47",
                "name": "影票/演唱会/赛事等娱乐票务"
            },
            {
                "wft": "437",
                "id": "2",
                "pid": "48",
                "name": "平台商"
            },
            {
                "wft": "291",
                "id": "2",
                "pid": "49",
                "name": "其他行业"
            },
            {
                "wft": "357",
                "id": "2",
                "pid": "50",
                "name": "城市交通卡缴费"
            },
            {
                "wft": "358",
                "id": "2",
                "pid": "50",
                "name": "其他生活缴费"
            },
            {
                "wft": "355",
                "id": "2",
                "pid": "50",
                "name": "停车场"
            },
            {
                "wft": "356",
                "id": "2",
                "pid": "50",
                "name": "物业管理费"
            },
            {
                "wft": "354",
                "id": "2",
                "pid": "50",
                "name": "有线电视缴费"
            },
            {
                "wft": "270",
                "id": "2",
                "pid": "51",
                "name": "软件"
            },
            {
                "wft": "137",
                "id": "2",
                "pid": "52",
                "name": "工艺品/盆栽/室内装饰品"
            },
            {
                "wft": "135",
                "id": "2",
                "pid": "52",
                "name": "计生用品"
            },
            {
                "wft": "131",
                "id": "2",
                "pid": "52",
                "name": "家居/建材/装饰/布艺类商城"
            },
            {
                "wft": "134",
                "id": "2",
                "pid": "52",
                "name": "家用电器"
            },
            {
                "wft": "136",
                "id": "2",
                "pid": "52",
                "name": "美妆/护肤/个人护理"
            },
            {
                "wft": "138",
                "id": "2",
                "pid": "52",
                "name": "汽车/摩托/自行车/其他交通工具/配件/改装"
            },
            {
                "wft": "407",
                "id": "2",
                "pid": "53",
                "name": "办证/刻章"
            },
            {
                "wft": "409",
                "id": "2",
                "pid": "53",
                "name": "报社/出版社"
            },
            {
                "wft": "410",
                "id": "2",
                "pid": "53",
                "name": "电台/电视台"
            },
            {
                "wft": "405",
                "id": "2",
                "pid": "53",
                "name": "广告公司"
            },
            {
                "wft": "406",
                "id": "2",
                "pid": "53",
                "name": "会展服务/活动策划"
            },
            {
                "wft": "402",
                "id": "2",
                "pid": "53",
                "name": "家政/婚庆服务/摄影服务"
            },
            {
                "wft": "408",
                "id": "2",
                "pid": "53",
                "name": "开锁工具"
            },
            {
                "wft": "221",
                "id": "2",
                "pid": "53",
                "name": "人才中介机构/招聘/猎头"
            },
            {
                "wft": "404",
                "id": "2",
                "pid": "53",
                "name": "丧葬行业"
            },
            {
                "wft": "223",
                "id": "2",
                "pid": "53",
                "name": "网上生活服务平台"
            },
            {
                "wft": "403",
                "id": "2",
                "pid": "53",
                "name": "印刷/维修服务/排版/刻板"
            },
            {
                "wft": "222",
                "id": "2",
                "pid": "53",
                "name": "职业社交/婚介/交友"
            },
            {
                "wft": "401",
                "id": "2",
                "pid": "53",
                "name": "咨询/法律咨询/金融咨询等"
            },
            {
                "wft": "121",
                "id": "2",
                "pid": "54",
                "name": "服饰类商城/服饰配件/箱包"
            },
            {
                "wft": "123",
                "id": "2",
                "pid": "54",
                "name": "户外/运动/健身器材/安防"
            },
            {
                "wft": "126",
                "id": "2",
                "pid": "54",
                "name": "黄金珠宝/钻石/玉石"
            },
            {
                "wft": "124",
                "id": "2",
                "pid": "54",
                "name": "乐器"
            },
            {
                "wft": "122",
                "id": "2",
                "pid": "54",
                "name": "礼品/鲜花/纪念品"
            },
            {
                "wft": "127",
                "id": "2",
                "pid": "54",
                "name": "饰品"
            },
            {
                "wft": "125",
                "id": "2",
                "pid": "54",
                "name": "手表/钟表/眼镜"
            },
            {
                "wft": "191",
                "id": "2",
                "pid": "55",
                "name": "宠物/宠物食品"
            },
            {
                "wft": "192",
                "id": "2",
                "pid": "55",
                "name": "非文物类收藏品"
            },
            {
                "wft": "195",
                "id": "2",
                "pid": "55",
                "name": "文物复制品销售/典当"
            },
            {
                "wft": "193",
                "id": "2",
                "pid": "55",
                "name": "文物经营"
            },
            {
                "wft": "194",
                "id": "2",
                "pid": "55",
                "name": "文物拍卖"
            },
            {
                "wft": "181",
                "id": "2",
                "pid": "56",
                "name": "书籍/音像"
            },
            {
                "wft": "182",
                "id": "2",
                "pid": "56",
                "name": "文具"
            },
            {
                "wft": "142",
                "id": "2",
                "pid": "57",
                "name": "办公设备"
            },
            {
                "wft": "141",
                "id": "2",
                "pid": "57",
                "name": "数码产品"
            },
            {
                "wft": "281",
                "id": "2",
                "pid": "58",
                "name": "彩铃"
            },
            {
                "wft": "421",
                "id": "2",
                "pid": "59",
                "name": "电信运营商"
            },
            {
                "wft": "423",
                "id": "2",
                "pid": "59",
                "name": "话费通讯"
            },
            {
                "wft": "422",
                "id": "2",
                "pid": "59",
                "name": "宽带收费"
            },
            {
                "wft": "261",
                "id": "2",
                "pid": "60",
                "name": "门户/资讯/论坛"
            },
            {
                "wft": "262",
                "id": "2",
                "pid": "60",
                "name": "视频/网络小说/在线图书/音乐"
            },
            {
                "wft": "264",
                "id": "2",
                "pid": "60",
                "name": "搜索引擎/网络广告/网络推广/视频制作"
            },
            {
                "wft": "265",
                "id": "2",
                "pid": "60",
                "name": "游戏/点卡/金币"
            },
            {
                "wft": "263",
                "id": "2",
                "pid": "60",
                "name": "域名/建站/主机/代码"
            },
            {
                "wft": "384",
                "id": "2",
                "pid": "61",
                "name": "百货"
            },
            {
                "wft": "382",
                "id": "2",
                "pid": "61",
                "name": "便利店"
            },
            {
                "wft": "381",
                "id": "2",
                "pid": "61",
                "name": "超市"
            },
            {
                "wft": "385",
                "id": "2",
                "pid": "61",
                "name": "其他综合零售"
            },
            {
                "wft": "383",
                "id": "2",
                "pid": "61",
                "name": "自动贩卖机"
            },
            {
                "wft": "362",
                "id": "2",
                "pid": "62",
                "name": "保健信息咨询/心理咨询/体检卡"
            },
            {
                "wft": "364",
                "id": "2",
                "pid": "62",
                "name": "挂号平台"
            },
            {
                "wft": "365",
                "id": "2",
                "pid": "62",
                "name": "亲子鉴定/催眠"
            },
            {
                "wft": "363",
                "id": "2",
                "pid": "62",
                "name": "私立/民营医院/诊所"
            },
            {
                "wft": "361",
                "id": "2",
                "pid": "62",
                "name": "药品"
            },
            {
                "wft": "366",
                "id": "2",
                "pid": "62",
                "name": "中草药原材料"
            },
            {
                "wft": "342",
                "id": "2",
                "pid": "63",
                "name": "俱乐部/高尔夫球场/休闲会所"
            },
            {
                "wft": "341",
                "id": "2",
                "pid": "63",
                "name": "美容/健身类会所"
            },
            {
                "wft": "343",
                "id": "2",
                "pid": "63",
                "name": "游艺厅/KTV/网吧"
            },
            {
                "wft": "439",
                "id": "2",
                "pid": "64",
                "name": "单用途预付卡"
            },
            {
                "wft": "436",
                "id": "2",
                "pid": "65",
                "name": "直销业务"
            },
            {
                "wft": "438",
                "id": "2",
                "pid": "66",
                "name": "众筹"
            },
            {
                "wft": "321",
                "id": "2",
                "pid": "67",
                "name": "室内装饰设计服务"
            },
            {
                "wft": "353",
                "id": "3",
                "pid": "68",
                "name": "事业单位"
            },
            {
                "wft": "359",
                "id": "3",
                "pid": "68",
                "name": "水电煤缴费/交通罚款等生活缴费"
            },
            {
                "wft": "352",
                "id": "3",
                "pid": "68",
                "name": "政府机构"
            },
            {
                "wft": "183",
                "id": "3",
                "pid": "69",
                "name": "旅馆/酒店/景区/度假区"
            },
            {
                "wft": "177",
                "id": "3",
                "pid": "69",
                "name": "旅游服务平台"
            },
            {
                "wft": "397",
                "id": "3",
                "pid": "70",
                "name": "道路运输"
            },
            {
                "wft": "491",
                "id": "3",
                "pid": "70",
                "name": "港口经营港口理货"
            },
            {
                "wft": "399",
                "id": "3",
                "pid": "70",
                "name": "海运"
            },
            {
                "wft": "492",
                "id": "3",
                "pid": "70",
                "name": "航空运输"
            },
            {
                "wft": "398",
                "id": "3",
                "pid": "70",
                "name": "水路运输"
            },
            {
                "wft": "396",
                "id": "3",
                "pid": "70",
                "name": "铁路货物运输"
            },
            {
                "wft": "493",
                "id": "3",
                "pid": "70",
                "name": "租车"
            },
            {
                "wft": "331",
                "id": "3",
                "pid": "71",
                "name": "公立院校"
            },
            {
                "wft": "412",
                "id": "3",
                "pid": "72",
                "name": "物流/快递公司"
            },
            {
                "wft": "165",
                "id": "3",
                "pid": "73",
                "name": "火车票/船票/车票等交通票务"
            },
            {
                "wft": "324",
                "id": "3",
                "pid": "74",
                "name": "城市交通卡缴费"
            },
            {
                "wft": "325",
                "id": "3",
                "pid": "74",
                "name": "其他生活缴费"
            },
            {
                "wft": "319",
                "id": "3",
                "pid": "74",
                "name": "停车场"
            },
            {
                "wft": "323",
                "id": "3",
                "pid": "74",
                "name": "物业管理费"
            },
            {
                "wft": "318",
                "id": "3",
                "pid": "74",
                "name": "有线电视缴费"
            },
            {
                "wft": "478",
                "id": "3",
                "pid": "75",
                "name": "报社/出版社"
            },
            {
                "wft": "479",
                "id": "3",
                "pid": "75",
                "name": "电台/电视台"
            },
            {
                "wft": "369",
                "id": "3",
                "pid": "76",
                "name": "保健信息咨询/心理咨询/体检卡"
            },
            {
                "wft": "367",
                "id": "3",
                "pid": "76",
                "name": "公立医院"
            },
            {
                "wft": "379",
                "id": "3",
                "pid": "76",
                "name": "挂号平台"
            },
            {
                "wft": "368",
                "id": "3",
                "pid": "76",
                "name": "药品"
            }
        ]
    ],
    bank: [
        {
            "bankNo": "102100099996",
            "bankName": "中国工商银行"
        },
        {
            "bankNo": "103100000026",
            "bankName": "中国农业银行股份有限公司"
        },
        {
            "bankNo": "104100000004",
            "bankName": "中国银行总行"
        },
        {
            "bankNo": "105100000017",
            "bankName": "中国建设银行股份有限公司总行"
        },
        {
            "bankNo": "301290000007",
            "bankName": "交通银行"
        },
        {
            "bankNo": "302100011000",
            "bankName": "中信银行股份有限公司"
        },
        {
            "bankNo": "303100000006",
            "bankName": "中国光大银行"
        },
        {
            "bankNo": "304100040000",
            "bankName": "华夏银行股份有限公司总行"
        },
        {
            "bankNo": "305100000013",
            "bankName": "中国民生银行"
        },
        {
            "bankNo": "306581000003",
            "bankName": "广发银行股份有限公司"
        },
        {
            "bankNo": "307584007998",
            "bankName": "平安银行（原深圳发展银行）"
        },
        {
            "bankNo": "308584000013",
            "bankName": "招商银行股份有限公司"
        },
        {
            "bankNo": "309391000011",
            "bankName": "兴业银行总行"
        },
        {
            "bankNo": "310290000013",
            "bankName": "上海浦东发展银行"
        },
        {
            "bankNo": "313100000013",
            "bankName": "北京银行"
        },
        {
            "bankNo": "313192000013",
            "bankName": "包商银行股份有限公司"
        },
        {
            "bankNo": "313241066661",
            "bankName": "吉林银行"
        },
        {
            "bankNo": "313261000018",
            "bankName": "哈尔滨银行结算中心"
        },
        {
            "bankNo": "313301099999",
            "bankName": "江苏银行股份有限公司"
        },
        {
            "bankNo": "313331000014",
            "bankName": "杭州银行股份有限公司"
        },
        {
            "bankNo": "313651099999",
            "bankName": "成都银行"
        },
        {
            "bankNo": "313653000013",
            "bankName": "重庆银行"
        },
        {
            "bankNo": "313791000015",
            "bankName": "西安银行股份有限公司"
        },
        {
            "bankNo": "315456000105",
            "bankName": "恒丰银行"
        },
        {
            "bankNo": "316331000018",
            "bankName": "浙商银行"
        },
        {
            "bankNo": "319361000013",
            "bankName": "徽商银行股份有限公司"
        },
        {
            "bankNo": "325290000012",
            "bankName": "上海银行股份有限公司"
        },
        {
            "bankNo": "402100000018",
            "bankName": "北京农村商业银行股份有限公司"
        },
        {
            "bankNo": "403100000004",
            "bankName": "中国邮政储蓄银行有限责任公司"
        },
        {
            "bankNo": "402221010013",
            "bankName": "辽宁省农村信用社联合社"
        }
    ]
}
var normalCategory = [];
var industry = module.exports.industry;
normalCategory.push(industry[0]);
var normalSecondary = [],three = [];
var second = industry[1];

var i;
for (i in second){
    if (second[i].id == '1'){
        normalSecondary.push(second[i]);
    }
}
var threes = industry[2];
for (i in threes) {
    if (threes[i].pid == '1') {
        three.push(threes[i]);
    }
}
normalCategory.push(normalSecondary);
normalCategory.push(three);
module.exports.normalCategory = normalCategory;
function category(column,value,elm){
    let nColumn = [],nsColumn = [];
    let currColumn = industry[column];
    let currItem = currColumn[value];
    let nextColumn = industry[column + 1];
    let parentid = (column == 0) ? currItem.id : currItem.pid;
    let str = parentid.toString();
    let currId = currItem.id;

    for (i in nextColumn) {
        let item = nextColumn[i];
        let cruuid = (column==0) ? item.id : item.pid;
        if (cruuid == str) {
            nColumn.push(item);
        }
    }
    var strs = nColumn[0].pid;
    console.log(typeof  column);
    if (column == 0){
        for (i in threes) {
            let item = threes[i];
            let cruuid = threes[i].pid;
            console.log(cruuid);
            if (cruuid == strs) {
                nsColumn.push(item);
            }
        }
        module.exports.ncolumn = nsColumn;
    }

    // switch (column) {
    //     case 0:
    //         for (i in nextColumn) {
    //             let item = nextColumn[i];
    //             let cruuid = item.id;
    //             if (cruuid == str) {
    //                 nColumn.push(item);
    //             }
    //         }
    //     break;

    //     case 1:
    //         for (i in nextColumn) {
    //             let item = nextColumn[i];
    //             let cruuid = item.pid;
    //             if (cruuid == str) {
    //                 nColumn.push(item);
    //             }
    //         }
    //     break;

    //     case 2:

    //     break;
    // }
    console.log(nColumn);
    console.log(nsColumn);
    module.exports.column = nColumn;
}
module.exports.category = category;
