module.exports =[
    {
        "bankNo": "102100099996",
        "bankName": "中国工商银行"
    },
    {
        "bankNo": "103100000026",
        "bankName": "中国农业银行股份有限公司"
    },
    {
        "bankNo": "104100000004",
        "bankName": "中国银行总行"
    },
    {
        "bankNo": "105100000017",
        "bankName": "中国建设银行股份有限公司总行"
    },
    {
        "bankNo": "301290000007",
        "bankName": "交通银行"
    },
    {
        "bankNo": "302100011000",
        "bankName": "中信银行股份有限公司"
    },
    {
        "bankNo": "303100000006",
        "bankName": "中国光大银行"
    },
    {
        "bankNo": "304100040000",
        "bankName": "华夏银行股份有限公司总行"
    },
    {
        "bankNo": "305100000013",
        "bankName": "中国民生银行"
    },
    {
        "bankNo": "306581000003",
        "bankName": "广发银行股份有限公司"
    },
    {
        "bankNo": "307584007998",
        "bankName": "平安银行（原深圳发展银行）"
    },
    {
        "bankNo": "308584000013",
        "bankName": "招商银行股份有限公司"
    },
    {
        "bankNo": "309391000011",
        "bankName": "兴业银行总行"
    },
    {
        "bankNo": "310290000013",
        "bankName": "上海浦东发展银行"
    },
    {
        "bankNo": "313100000013",
        "bankName": "北京银行"
    },
    {
        "bankNo": "313192000013",
        "bankName": "包商银行股份有限公司"
    },
    {
        "bankNo": "313241066661",
        "bankName": "吉林银行"
    },
    {
        "bankNo": "313261000018",
        "bankName": "哈尔滨银行结算中心"
    },
    {
        "bankNo": "313301099999",
        "bankName": "江苏银行股份有限公司"
    },
    {
        "bankNo": "313331000014",
        "bankName": "杭州银行股份有限公司"
    },
    {
        "bankNo": "313651099999",
        "bankName": "成都银行"
    },
    {
        "bankNo": "313653000013",
        "bankName": "重庆银行"
    },
    {
        "bankNo": "313791000015",
        "bankName": "西安银行股份有限公司"
    },
    {
        "bankNo": "315456000105",
        "bankName": "恒丰银行"
    },
    {
        "bankNo": "316331000018",
        "bankName": "浙商银行"
    },
    {
        "bankNo": "319361000013",
        "bankName": "徽商银行股份有限公司"
    },
    {
        "bankNo": "325290000012",
        "bankName": "上海银行股份有限公司"
    },
    {
        "bankNo": "402100000018",
        "bankName": "北京农村商业银行股份有限公司"
    },
    {
        "bankNo": "403100000004",
        "bankName": "中国邮政储蓄银行有限责任公司"
    },
    {
        "bankNo": "402221010013",
        "bankName": "辽宁省农村信用社联合社"
    }
]