module.exports=[
    [
        {
            "id": "1",
            "cat": "企业"
        },
        {
            "id": "2",
            "cat": "个体工商户"
        },
        {
            "id": "3",
            "cat": "事业单位"
        }
    ],
    [
        {
            "p_id": "1",
            "id": "1",
            "cat": "电商/团购"
        },
        {
            "p_id": "1",
            "id": "2",
            "cat": "线下零售"
        },
        {
            "p_id": "1",
            "id": "3",
            "cat": "生活/家居"
        },
        {
            "p_id": "1",
            "id": "4",
            "cat": "餐饮/食品"
        },
        {
            "p_id": "1",
            "id": "5",
            "cat": "生活/咨询服务"
        },
        {
            "p_id": "1",
            "id": "6",
            "cat": "票务/旅游"
        },
        {
            "p_id": "1",
            "id": "7",
            "cat": "网络虚拟服务"
        },
        {
            "p_id": "1",
            "id": "8",
            "cat": "教育/培训"
        },
        {
            "p_id": "1",
            "id": "9",
            "cat": "娱乐/健身服务"
        },
        {
            "p_id": "1",
            "id": "10",
            "cat": "房地产"
        },
        {
            "p_id": "1",
            "id": "11",
            "cat": "医疗"
        },
        {
            "p_id": "1",
            "id": "12",
            "cat": "收藏/拍卖"
        },
        {
            "p_id": "1",
            "id": "13",
            "cat": "苗木/绿化"
        },
        {
            "p_id": "1",
            "id": "14",
            "cat": "交通运输服务类"
        },
        {
            "p_id": "1",
            "id": "15",
            "cat": "生活缴费"
        },
        {
            "p_id": "1",
            "id": "16",
            "cat": "公益"
        },
        {
            "p_id": "1",
            "id": "17",
            "cat": "通信"
        },
        {
            "p_id": "1",
            "id": "18",
            "cat": "金融"
        },
        {
            "p_id": "1",
            "id": "19",
            "cat": "其他"
        },
        {
            "p_id": "2",
            "id": "20",
            "cat": "餐饮/食品"
        },
        {
            "p_id": "2",
            "id": "21",
            "cat": "线下零售"
        },
        {
            "p_id": "2",
            "id": "22",
            "cat": "生活/家居"
        },
        {
            "p_id": "2",
            "id": "23",
            "cat": "生活/咨询服务"
        },
        {
            "p_id": "2",
            "id": "24",
            "cat": "娱乐/健身服务"
        },
        {
            "p_id": "2",
            "id": "25",
            "cat": "票务/旅游"
        },
        {
            "p_id": "2",
            "id": "26",
            "cat": "网络虚拟服务"
        },
        {
            "p_id": "2",
            "id": "27",
            "cat": "教育/培训"
        },
        {
            "p_id": "2",
            "id": "28",
            "cat": "医疗"
        },
        {
            "p_id": "2",
            "id": "29",
            "cat": "苗木/绿化"
        },
        {
            "p_id": "2",
            "id": "30",
            "cat": "通信"
        },
        {
            "p_id": "2",
            "id": "31",
            "cat": "生活缴费"
        },
        {
            "p_id": "2",
            "id": "32",
            "cat": "金融"
        },
        {
            "p_id": "2",
            "id": "33",
            "cat": "其他"
        },
        {
            "p_id": "3",
            "id": "34",
            "cat": "医疗"
        },
        {
            "p_id": "3",
            "id": "35",
            "cat": "教育/培训"
        },
        {
            "p_id": "3",
            "id": "36",
            "cat": "其他生活缴费"
        }
    ],
    [
        {
            "bcat": "1-1-1",
            "p_id": "1",
            "id": "1",
            "cat": "线上商超"
        },
        {
            "bcat": "1-1-2",
            "p_id": "1",
            "id": "2",
            "cat": "团购"
        },
        {
            "bcat": "1-1-3",
            "p_id": "1",
            "id": "3",
            "cat": "海淘"
        },
        {
            "bcat": "1-2-4",
            "p_id": "2",
            "id": "4",
            "cat": "超市"
        },
        {
            "bcat": "1-2-5",
            "p_id": "2",
            "id": "5",
            "cat": "便利店"
        },
        {
            "bcat": "1-2-6",
            "p_id": "2",
            "id": "6",
            "cat": "自动贩卖机"
        },
        {
            "bcat": "1-2-7",
            "p_id": "2",
            "id": "7",
            "cat": "百货"
        },
        {
            "bcat": "1-2-8",
            "p_id": "2",
            "id": "8",
            "cat": "其他综合零售"
        },
        {
            "bcat": "1-3-9",
            "p_id": "3",
            "id": "9",
            "cat": "户外/运动/健身器材/安防"
        },
        {
            "bcat": "1-3-10",
            "p_id": "3",
            "id": "10",
            "cat": "黄金珠宝/钻石/玉石"
        },
        {
            "bcat": "1-3-11",
            "p_id": "3",
            "id": "11",
            "cat": "母婴用品/儿童玩具"
        },
        {
            "bcat": "1-3-12",
            "p_id": "3",
            "id": "12",
            "cat": "家装建材/家居家纺"
        },
        {
            "bcat": "1-3-13",
            "p_id": "3",
            "id": "13",
            "cat": "美妆/护肤"
        },
        {
            "bcat": "1-3-14",
            "p_id": "3",
            "id": "14",
            "cat": "鲜花/盆栽/室内装饰品"
        },
        {
            "bcat": "1-3-15",
            "p_id": "3",
            "id": "15",
            "cat": "交通工具/配件/改装"
        },
        {
            "bcat": "1-3-16",
            "p_id": "3",
            "id": "16",
            "cat": "服饰/箱包/饰品"
        },
        {
            "bcat": "1-3-17",
            "p_id": "3",
            "id": "17",
            "cat": "钟表/眼镜"
        },
        {
            "bcat": "1-3-18",
            "p_id": "3",
            "id": "18",
            "cat": "宠物/宠物食品/饲料"
        },
        {
            "bcat": "1-3-19",
            "p_id": "3",
            "id": "19",
            "cat": "数码家电/办公设备"
        },
        {
            "bcat": "1-3-20",
            "p_id": "3",
            "id": "20",
            "cat": "书籍/音像/文具/乐器"
        },
        {
            "bcat": "1-3-21",
            "p_id": "3",
            "id": "21",
            "cat": "计生用品"
        },
        {
            "bcat": "1-4-22",
            "p_id": "4",
            "id": "22",
            "cat": "食品"
        },
        {
            "bcat": "1-4-23",
            "p_id": "4",
            "id": "23",
            "cat": "餐饮"
        },
        {
            "bcat": "1-5-24",
            "p_id": "5",
            "id": "24",
            "cat": "婚庆/摄影"
        },
        {
            "bcat": "1-5-25",
            "p_id": "5",
            "id": "25",
            "cat": "装饰/设计"
        },
        {
            "bcat": "1-5-26",
            "p_id": "5",
            "id": "26",
            "cat": "家政/维修服务"
        },
        {
            "bcat": "1-5-27",
            "p_id": "5",
            "id": "27",
            "cat": "广告/会展/活动策划"
        },
        {
            "bcat": "1-5-28",
            "p_id": "5",
            "id": "28",
            "cat": "咨询/法律咨询/金融咨询等"
        },
        {
            "bcat": "1-5-29",
            "p_id": "5",
            "id": "29",
            "cat": "人才中介机构/招聘/猎头"
        },
        {
            "bcat": "1-5-30",
            "p_id": "5",
            "id": "30",
            "cat": "职业社交/婚介/交友"
        },
        {
            "bcat": "1-5-31",
            "p_id": "5",
            "id": "31",
            "cat": "网上生活服务平台"
        },
        {
            "bcat": "1-6-32",
            "p_id": "6",
            "id": "32",
            "cat": "机票/机票代理"
        },
        {
            "bcat": "1-6-33",
            "p_id": "6",
            "id": "33",
            "cat": "旅馆/酒店/度假区"
        },
        {
            "bcat": "1-6-34",
            "p_id": "6",
            "id": "34",
            "cat": "娱乐票务"
        },
        {
            "bcat": "1-6-35",
            "p_id": "6",
            "id": "35",
            "cat": "交通票务"
        },
        {
            "bcat": "1-6-36",
            "p_id": "6",
            "id": "36",
            "cat": "景区/宗教"
        },
        {
            "bcat": "1-6-37",
            "p_id": "6",
            "id": "37",
            "cat": "旅行社"
        },
        {
            "bcat": "1-6-38",
            "p_id": "6",
            "id": "38",
            "cat": "旅游服务平台"
        },
        {
            "bcat": "1-7-39",
            "p_id": "7",
            "id": "39",
            "cat": "在线图书/视频/音乐"
        },
        {
            "bcat": "1-7-40",
            "p_id": "7",
            "id": "40",
            "cat": "软件/建站/技术开发"
        },
        {
            "bcat": "1-7-41",
            "p_id": "7",
            "id": "41",
            "cat": "网络推广/网络广告"
        },
        {
            "bcat": "1-7-42",
            "p_id": "7",
            "id": "42",
            "cat": "游戏"
        },
        {
            "bcat": "1-7-43",
            "p_id": "7",
            "id": "43",
            "cat": "门户/资讯/论坛"
        },
        {
            "bcat": "1-8-44",
            "p_id": "8",
            "id": "44",
            "cat": "教育/培训/考试缴费/学费"
        },
        {
            "bcat": "1-8-45",
            "p_id": "8",
            "id": "45",
            "cat": "私立院校"
        },
        {
            "bcat": "1-9-46",
            "p_id": "9",
            "id": "46",
            "cat": "俱乐部/休闲会所"
        },
        {
            "bcat": "1-9-47",
            "p_id": "9",
            "id": "47",
            "cat": "美容/健身类会所"
        },
        {
            "bcat": "1-9-48",
            "p_id": "9",
            "id": "48",
            "cat": "游艺厅/KTV/网吧"
        },
        {
            "bcat": "1-10-49",
            "p_id": "10",
            "id": "49",
            "cat": "房地产"
        },
        {
            "bcat": "1-11-50",
            "p_id": "11",
            "id": "50",
            "cat": "保健信息咨询平台"
        },
        {
            "bcat": "1-11-51",
            "p_id": "11",
            "id": "51",
            "cat": "保健器械/医疗器械/非处方药品"
        },
        {
            "bcat": "1-11-52",
            "p_id": "11",
            "id": "52",
            "cat": "私立/民营医院/诊所"
        },
        {
            "bcat": "1-11-53",
            "p_id": "11",
            "id": "53",
            "cat": "挂号平台"
        },
        {
            "bcat": "1-12-54",
            "p_id": "12",
            "id": "54",
            "cat": "文物经营/文物复制品销售"
        },
        {
            "bcat": "1-12-55",
            "p_id": "12",
            "id": "55",
            "cat": "拍卖/典当"
        },
        {
            "bcat": "1-12-56",
            "p_id": "12",
            "id": "56",
            "cat": "非文物类收藏品"
        },
        {
            "bcat": "1-13-57",
            "p_id": "13",
            "id": "57",
            "cat": "苗木种植/园林绿化"
        },
        {
            "bcat": "1-13-58",
            "p_id": "13",
            "id": "58",
            "cat": "化肥/农用药剂等"
        },
        {
            "bcat": "1-14-59",
            "p_id": "14",
            "id": "59",
            "cat": "物流/快递公司"
        },
        {
            "bcat": "1-14-60",
            "p_id": "14",
            "id": "60",
            "cat": "加油"
        },
        {
            "bcat": "1-14-61",
            "p_id": "14",
            "id": "61",
            "cat": "港口经营港口理货"
        },
        {
            "bcat": "1-14-62",
            "p_id": "14",
            "id": "62",
            "cat": "租车"
        },
        {
            "bcat": "1-15-63",
            "p_id": "15",
            "id": "63",
            "cat": "水电煤缴费/交通罚款等生活缴费"
        },
        {
            "bcat": "1-15-64",
            "p_id": "15",
            "id": "64",
            "cat": "停车缴费"
        },
        {
            "bcat": "1-15-65",
            "p_id": "15",
            "id": "65",
            "cat": "城市交通/高速收费"
        },
        {
            "bcat": "1-15-66",
            "p_id": "15",
            "id": "66",
            "cat": "有线电视缴费"
        },
        {
            "bcat": "1-15-67",
            "p_id": "15",
            "id": "67",
            "cat": "物业管理费"
        },
        {
            "bcat": "1-15-68",
            "p_id": "15",
            "id": "68",
            "cat": "其他生活缴费"
        },
        {
            "bcat": "1-16-69",
            "p_id": "16",
            "id": "69",
            "cat": "公益"
        },
        {
            "bcat": "1-17-70",
            "p_id": "17",
            "id": "70",
            "cat": "电信运营商"
        },
        {
            "bcat": "1-17-71",
            "p_id": "17",
            "id": "71",
            "cat": "宽带收费"
        },
        {
            "bcat": "1-17-72",
            "p_id": "17",
            "id": "72",
            "cat": "话费通讯"
        },
        {
            "bcat": "1-18-73",
            "p_id": "18",
            "id": "73",
            "cat": "众筹"
        },
        {
            "bcat": "1-18-74",
            "p_id": "18",
            "id": "74",
            "cat": "保险业务"
        },
        {
            "bcat": "1-18-75",
            "p_id": "18",
            "id": "75",
            "cat": "财经资讯"
        },
        {
            "bcat": "1-18-76",
            "p_id": "18",
            "id": "76",
            "cat": "股票软件类"
        },
        {
            "bcat": "1-19-77",
            "p_id": "19",
            "id": "77",
            "cat": "其他行业"
        },
        {
            "bcat": "2-20-78",
            "p_id": "20",
            "id": "78",
            "cat": "食品"
        },
        {
            "bcat": "2-20-79",
            "p_id": "20",
            "id": "79",
            "cat": "餐饮"
        },
        {
            "bcat": "2-21-80",
            "p_id": "21",
            "id": "80",
            "cat": "便利店"
        },
        {
            "bcat": "2-21-81",
            "p_id": "21",
            "id": "81",
            "cat": "其他综合零售"
        },
        {
            "bcat": "2-22-82",
            "p_id": "22",
            "id": "82",
            "cat": "户外/运动/健身器材/安防"
        },
        {
            "bcat": "2-22-83",
            "p_id": "22",
            "id": "83",
            "cat": "母婴用品/儿童玩具"
        },
        {
            "bcat": "2-22-84",
            "p_id": "22",
            "id": "84",
            "cat": "家装建材/家居家纺"
        },
        {
            "bcat": "2-22-85",
            "p_id": "22",
            "id": "85",
            "cat": "美妆/护肤"
        },
        {
            "bcat": "2-22-86",
            "p_id": "22",
            "id": "86",
            "cat": "鲜花/盆栽/室内装饰品"
        },
        {
            "bcat": "2-22-87",
            "p_id": "22",
            "id": "87",
            "cat": "交通工具/配件/改装"
        },
        {
            "bcat": "2-22-88",
            "p_id": "22",
            "id": "88",
            "cat": "服饰/箱包/饰品"
        },
        {
            "bcat": "2-22-89",
            "p_id": "22",
            "id": "89",
            "cat": "钟表/眼镜"
        },
        {
            "bcat": "2-22-90",
            "p_id": "22",
            "id": "90",
            "cat": "宠物/宠物食品/饲料"
        },
        {
            "bcat": "2-22-91",
            "p_id": "22",
            "id": "91",
            "cat": "数码家电/办公设备"
        },
        {
            "bcat": "2-22-92",
            "p_id": "22",
            "id": "92",
            "cat": "书籍/音像/文具/乐器"
        },
        {
            "bcat": "2-22-93",
            "p_id": "22",
            "id": "93",
            "cat": "计生用品"
        },
        {
            "bcat": "2-23-94",
            "p_id": "23",
            "id": "94",
            "cat": "婚庆/摄影"
        },
        {
            "bcat": "2-23-95",
            "p_id": "23",
            "id": "95",
            "cat": "装饰/设计"
        },
        {
            "bcat": "2-23-96",
            "p_id": "23",
            "id": "96",
            "cat": "家政/维修服务"
        },
        {
            "bcat": "2-23-97",
            "p_id": "23",
            "id": "97",
            "cat": "广告/会展/活动策划"
        },
        {
            "bcat": "2-23-98",
            "p_id": "23",
            "id": "98",
            "cat": "咨询/法律咨询/金融咨询等"
        },
        {
            "bcat": "2-23-99",
            "p_id": "23",
            "id": "99",
            "cat": "职业社交/婚介/交友"
        },
        {
            "bcat": "2-24-100",
            "p_id": "24",
            "id": "100",
            "cat": "俱乐部/休闲会所"
        },
        {
            "bcat": "2-24-101",
            "p_id": "24",
            "id": "101",
            "cat": "美容/健身类会所"
        },
        {
            "bcat": "2-24-102",
            "p_id": "24",
            "id": "102",
            "cat": "游艺厅/KTV/网吧"
        },
        {
            "bcat": "2-25-103",
            "p_id": "25",
            "id": "103",
            "cat": "旅馆/酒店/度假区"
        },
        {
            "bcat": "2-25-104",
            "p_id": "25",
            "id": "104",
            "cat": "娱乐票务"
        },
        {
            "bcat": "2-25-105",
            "p_id": "25",
            "id": "105",
            "cat": "交通票务"
        },
        {
            "bcat": "2-26-106",
            "p_id": "26",
            "id": "106",
            "cat": "软件/建站/技术开发"
        },
        {
            "bcat": "2-26-107",
            "p_id": "26",
            "id": "107",
            "cat": "网络推广/网络广告"
        },
        {
            "bcat": "2-26-108",
            "p_id": "26",
            "id": "108",
            "cat": "游戏"
        },
        {
            "bcat": "2-27-109",
            "p_id": "27",
            "id": "109",
            "cat": "教育/培训/考试缴费/学费"
        },
        {
            "bcat": "2-28-110",
            "p_id": "28",
            "id": "110",
            "cat": "私立/民营医院/诊所"
        },
        {
            "bcat": "2-28-111",
            "p_id": "28",
            "id": "111",
            "cat": "保健器械/医疗器械/非处方药品"
        },
        {
            "bcat": "2-29-112",
            "p_id": "29",
            "id": "112",
            "cat": "苗木种植/园林绿化"
        },
        {
            "bcat": "2-30-113",
            "p_id": "30",
            "id": "113",
            "cat": "话费通讯"
        },
        {
            "bcat": "2-31-114",
            "p_id": "31",
            "id": "114",
            "cat": "生活缴费"
        },
        {
            "bcat": "2-32-115",
            "p_id": "32",
            "id": "115",
            "cat": "财经资讯"
        },
        {
            "bcat": "2-33-116",
            "p_id": "33",
            "id": "116",
            "cat": "其他行业"
        },
        {
            "bcat": "3-34-117",
            "p_id": "34",
            "id": "117",
            "cat": "公立医院"
        },
        {
            "bcat": "3-34-118",
            "p_id": "34",
            "id": "118",
            "cat": "挂号平台"
        },
        {
            "bcat": "3-35-119",
            "p_id": "35",
            "id": "119",
            "cat": "公立院校"
        },
        {
            "bcat": "3-36-120",
            "p_id": "36",
            "id": "120",
            "cat": "水电煤缴费/交通罚款等生活缴费"
        },
        {
            "bcat": "3-36-121",
            "p_id": "36",
            "id": "121",
            "cat": "事业单位"
        },
        {
            "bcat": "3-36-122",
            "p_id": "36",
            "id": "122",
            "cat": "停车缴费"
        },
        {
            "bcat": "3-36-123",
            "p_id": "36",
            "id": "123",
            "cat": "城市交通/高速收费"
        },
        {
            "bcat": "3-36-124",
            "p_id": "36",
            "id": "124",
            "cat": "物业管理费"
        },
        {
            "bcat": "3-36-125",
            "p_id": "36",
            "id": "125",
            "cat": "其他生活缴费"
        }
    ]
]