module.exports = {
    "businessLicenseType":{
        "NATIONAL_LEGAL" : "营业执照",
        "NATIONAL_LEGAL_MERGE" : "营业执照（多证合一）",
        "INST_RGST_CTF" : "事业单位法人证书"
    },
    "contactType":{
        'LEGAL_PERSON':'法人', 
        'CONTROLLER':'实际控制人', 
        'AGENT':'代理人', 
        'OTHER':'其他'
    },
    "bank":{
        "102100099996":"中国工商银行",
        "103100000026":"中国农业银行股份有限公司",
        "104100000004":"中国银行总行",
        "105100000017":"中国建设银行股份有限公司总行",
        "301290000007":"交通银行",
        "302100011000":"中信银行股份有限公司",
        "303100000006":"中国光大银行",
        "304100040000":"华夏银行股份有限公司总行",
        "305100000013":"中国民生银行",
        "306581000003":"广发银行股份有限公司",
        "307584007998":"平安银行（原深圳发展银行）",
        "308584000013":"招商银行股份有限公司",
        "309391000011":"兴业银行总行",
        "310290000013":"上海浦东发展银行",
        "313100000013":"北京银行",
        "313192000013":"包商银行股份有限公司",
        "313241066661":"吉林银行",
        "313261000018":"哈尔滨银行结算中心",
        "313301099999":"江苏银行股份有限公司",
        "313331000014":"杭州银行股份有限公司",
        "313651099999":"成都银行",
        "313653000013":"重庆银行",
        "313791000015":"西安银行股份有限公司",
        "315456000105":"恒丰银行",
        "316331000018":"浙商银行",
        "319361000013":"徽商银行股份有限公司",
        "325290000012":"上海银行股份有限公司",
        "402100000018":"北京农村商业银行股份有限公司",
        "403100000004":"中国邮政储蓄银行有限责任公司",
        "402221010013":"辽宁省农村信用社联合社"
    },
    "accountType": {
        1: '个人',
        2: '企业'
    },
}